modules/lang/org/+skyle.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-03-22 Thu 21:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Documentation of the +style feature</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Alexander Fu Xi" />
<!-- Responsive tags -->
<meta name="viewport" content="width=device-width, initial-scale=1"/>
<!-- dataTables css -->
<link rel="stylesheet" href="https://cdn.datatables.net/1.10.16/css/jquery.dataTables.min.css" crossorigin="anonymous">
<!-- bootstrap css -->
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/4.0.0/css/bootstrap.min.css" integrity="sha384-Gn5384xqQ1aoWXA+058RXPxPg6fy4IWvTNh0E263XmFcJlSAwiGgFAW/dAiS6JXm" crossorigin="anonymous">
<!-- jquery for bootstrap -->
<!-- popper for bootstrap -->
<!-- bootstrap js -->
<!-- dataTables js -->





</head>
<body>
<div id="content">
<h1 class="title">Documentation of the +style feature</h1>
<nav id="toc" data-toggle="toc" class="sticky-top"></nav>

<div id="outline-container-orga543527" class="outline-2">
<h2 id="orga543527">Style and scripts</h2>
<div class="outline-text-2" id="text-orga543527">
<p>
HTML export style sheets and external scripts are stored in the <code>org-html-head</code> directory by default, however, you can fully control that using variable <code>+org-html-export-style-dir</code> (which specify the directory) and <code>+org-html-export-style-list</code> (which specify the including order).
</p>
</div>
</div>

<div id="outline-container-org84d61fe" class="outline-2">
<h2 id="org84d61fe">DataTables Integration</h2>
<div class="outline-text-2" id="text-org84d61fe">
<p>
<a href="https://datatables.net/">DataTables</a> are integrated in the script file. To export a (potentially large) org-mode table, you can use the following snippet (through YASnippet) before a table:
</p>
<div class="org-src-container">
<pre class="src src-snippet"><span style="color: #6f7787;"># -*- mode: snippet -*-</span>
<span style="color: #6f7787;"># name: DataTable</span>
<span style="color: #6f7787;"># key: dt_</span>
<span style="color: #6f7787;"># --</span>
#+HTML_HEAD_EXTRA: &lt;script type=<span style="color: #A2BF8A;">"text/javascript"</span>&gt;
<span style="color: #6f7787;">#+HTML_HEAD_EXTRA:   $(document).ready(function() {</span>
<span style="color: #6f7787;">#+HTML_HEAD_EXTRA:     $('#$</span><span style="color: #A2BF8A;">2</span><span style="color: #6f7787;">').DataTable(); } );</span>
<span style="color: #6f7787;">#+HTML_HEAD_EXTRA: &lt;/script&gt;</span>
<span style="color: #6f7787;">#+CAPTION: $</span><span style="color: #A2BF8A;">1</span>
<span style="color: #6f7787;">#+ATTR_HTML: :id $</span><span style="color: #A2BF8A;">2</span>
<span style="color: #80A0C2;">$</span><span style="color: #A2BF8A;">0</span>
</pre>
</div>

<p>
Demo:
</p>
<table border="2" class="table table-striped table-sm table-bordered" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" id="dt">
<caption class="t-above"><span class="table-number">Table 1:</span> A demo table</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Base pairs</th>
<th scope="col" class="org-left">Genes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">φX174</td>
<td class="org-left">5,386</td>
<td class="org-left">11</td>
</tr>

<tr>
<td class="org-left">Human mitochondrion</td>
<td class="org-left">16,569</td>
<td class="org-left">37</td>
</tr>

<tr>
<td class="org-left">Nasuia deltocephalinicola</td>
<td class="org-left">112,091</td>
<td class="org-left">137</td>
</tr>

<tr>
<td class="org-left">Epstein-Barr virus (EBV)</td>
<td class="org-left">172,282</td>
<td class="org-left">80</td>
</tr>

<tr>
<td class="org-left">nucleomorph of Guillardia theta</td>
<td class="org-left">551,264</td>
<td class="org-left">511</td>
</tr>

<tr>
<td class="org-left">Mycoplasma genitalium</td>
<td class="org-left">580,073</td>
<td class="org-left">525</td>
</tr>

<tr>
<td class="org-left">Mycoplasma pneumoniae</td>
<td class="org-left">816,394</td>
<td class="org-left">679</td>
</tr>

<tr>
<td class="org-left">Rickettsia prowazekii</td>
<td class="org-left">1,111,523</td>
<td class="org-left">834</td>
</tr>

<tr>
<td class="org-left">Treponema pallidum</td>
<td class="org-left">1,138,011</td>
<td class="org-left">1,039</td>
</tr>

<tr>
<td class="org-left">Pelagibacter ubique</td>
<td class="org-left">1,308,759</td>
<td class="org-left">1,354</td>
</tr>

<tr>
<td class="org-left">Helicobacter pylori</td>
<td class="org-left">1,667,867</td>
<td class="org-left">1,589</td>
</tr>

<tr>
<td class="org-left">Methanocaldococcus jannaschii</td>
<td class="org-left">1,664,970</td>
<td class="org-left">1,783</td>
</tr>

<tr>
<td class="org-left">Aeropyrum pernix</td>
<td class="org-left">1,669,695</td>
<td class="org-left">1,885</td>
</tr>

<tr>
<td class="org-left">Methanothermobacter thermoautotrophicus</td>
<td class="org-left">1,751,377</td>
<td class="org-left">2,008</td>
</tr>

<tr>
<td class="org-left">Streptococcus pneumoniae</td>
<td class="org-left">2,160,837</td>
<td class="org-left">2,236</td>
</tr>

<tr>
<td class="org-left">Pandoravirus</td>
<td class="org-left">2,473,870</td>
<td class="org-left">2556</td>
</tr>

<tr>
<td class="org-left">Listeria monocytogenes</td>
<td class="org-left">2,944,528</td>
<td class="org-left">2,926</td>
</tr>

<tr>
<td class="org-left">Synechocystis</td>
<td class="org-left">3,573,470</td>
<td class="org-left">4,003</td>
</tr>

<tr>
<td class="org-left">E. coli K-12</td>
<td class="org-left">4,639,221</td>
<td class="org-left">4,377</td>
</tr>

<tr>
<td class="org-left">E. coli O157:H7</td>
<td class="org-left">5.44 x 106</td>
<td class="org-left">5,416</td>
</tr>

<tr>
<td class="org-left">Schizosaccharomyces pombe</td>
<td class="org-left">12,462,637</td>
<td class="org-left">4,929</td>
</tr>

<tr>
<td class="org-left">Agrobacterium tumefaciens</td>
<td class="org-left">4,674,062</td>
<td class="org-left">5,419</td>
</tr>

<tr>
<td class="org-left">Pseudomonas aeruginosa</td>
<td class="org-left">6.3 x 106</td>
<td class="org-left">5,570</td>
</tr>

<tr>
<td class="org-left">Sinorhizobium meliloti</td>
<td class="org-left">6,691,694</td>
<td class="org-left">6,204</td>
</tr>

<tr>
<td class="org-left">Saccharomyces cerevisiae</td>
<td class="org-left">12,495,682</td>
<td class="org-left">5,770</td>
</tr>

<tr>
<td class="org-left">Neurospora crassa</td>
<td class="org-left">38,639,769</td>
<td class="org-left">10,082</td>
</tr>

<tr>
<td class="org-left">Thalassiosira pseudonana</td>
<td class="org-left">34.5 x 106</td>
<td class="org-left">11,242</td>
</tr>

<tr>
<td class="org-left">Naegleria gruberi</td>
<td class="org-left">41 x 106</td>
<td class="org-left">15,727</td>
</tr>

<tr>
<td class="org-left">Drosophila melanogaster</td>
<td class="org-left">122,653,977</td>
<td class="org-left">~17,000</td>
</tr>

<tr>
<td class="org-left">Caenorhabditis elegans</td>
<td class="org-left">100,258,171</td>
<td class="org-left">21,733</td>
</tr>

<tr>
<td class="org-left">Humans</td>
<td class="org-left">3.3 x 109</td>
<td class="org-left">~21,000</td>
</tr>

<tr>
<td class="org-left">Tetraodon nigroviridis (a pufferfish)</td>
<td class="org-left">3.42 x 108</td>
<td class="org-left">27,918</td>
</tr>

<tr>
<td class="org-left">Mouse</td>
<td class="org-left">2.8 x 109</td>
<td class="org-left">~23,000</td>
</tr>

<tr>
<td class="org-left">Amphibians</td>
<td class="org-left">109–1011</td>
<td class="org-left">?</td>
</tr>

<tr>
<td class="org-left">Arabidopsis thaliana</td>
<td class="org-left">0.135 x 109</td>
<td class="org-left">27,416</td>
</tr>

<tr>
<td class="org-left">Picea abies</td>
<td class="org-left">19.6 x 109</td>
<td class="org-left">28,354</td>
</tr>

<tr>
<td class="org-left">Psilotum nudum</td>
<td class="org-left">2.5 x 1011</td>
<td class="org-left">?</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org63c010e" class="outline-2">
<h2 id="org63c010e">Bootstrap Table of Contents</h2>
<div class="outline-text-2" id="text-org63c010e">
<p>
To use the table of contents, you need to add the following sentence before your exporting contents, after the <code>#+TITLE</code> / <code>#+AUTHOR</code> metadata (for subtree exporting, add it after the <code>:PROPERTIES:</code> block)
</p>
<div class="org-src-container">
<pre class="src src-html">#+OPTIONS: toc:nil H:2
#+HTML: &lt;<span style="color: #8EBCBB;">nav</span> <span style="color: #dac6d6;">id</span>=<span style="color: #A2BF8A;">"toc"</span> <span style="color: #dac6d6;">data-toggle</span>=<span style="color: #A2BF8A;">"toc"</span> <span style="color: #dac6d6;">class</span>=<span style="color: #A2BF8A;">"sticky-top"</span>&gt;&lt;/<span style="color: #8EBCBB;">nav</span>&gt;
</pre>
</div>
<p>
After adding that, the ToC should automatically work.
</p>
</div>
</div>

<div id="outline-container-org9c93144" class="outline-2">
<h2 id="org9c93144">Show/hide table / code blocks</h2>
<div class="outline-text-2" id="text-org9c93144">
<p>
It. Just. Works. Extend it (or apply the effect to other elements) using <code>./org-html-head/org.js</code>.
</p>

<p>
Demo:
</p>
<div class="org-src-container">
<pre class="src src-javascript">
<span style="color: #80A0C2;">function</span> <span style="color: #8EBCBB;">panelCollapse</span>(<span style="color: #dac6d6;">col</span>) {
    <span style="color: #80A0C2;">return</span> <span style="color: #A2BF8A;">"&lt;div id=\"col-"</span> + col.id + Math.random().toString(36).substring(7)
        + <span style="color: #A2BF8A;">"\" class=\"collapse\"&gt;&lt;/div&gt;"</span>;
}

$( document ).ready(<span style="color: #80A0C2;">function</span>() {
    $(<span style="color: #A2BF8A;">'body'</span>).attr(<span style="color: #A2BF8A;">"data-spy"</span>, <span style="color: #A2BF8A;">"scroll"</span>);
    $(<span style="color: #A2BF8A;">'body'</span>).attr(<span style="color: #A2BF8A;">"data-target"</span>, <span style="color: #A2BF8A;">"#toc"</span>);


    <span style="color: #6f7787;">// </span><span style="color: #6f7787;">The content (and postamble) should be in a container.</span>
    $(<span style="color: #A2BF8A;">'#content, #postamble'</span>).wrapAll(<span style="color: #A2BF8A;">"&lt;div class='container'&gt;&lt;/div&gt;"</span>);
    $(<span style="color: #A2BF8A;">'#toc, .outline-2'</span>).wrapAll(<span style="color: #A2BF8A;">"&lt;div class='row'&gt;&lt;/div&gt;"</span>);
    $(<span style="color: #A2BF8A;">'#toc'</span>).wrap(<span style="color: #A2BF8A;">"&lt;div class='col-md-3'&gt;&lt;/div&gt;"</span>);
    $(<span style="color: #A2BF8A;">'.outline-2'</span>).wrapAll(<span style="color: #A2BF8A;">"&lt;div class='col-md-9'&gt;&lt;/div&gt;"</span>);
    $(<span style="color: #A2BF8A;">'.col-md-9'</span>).after( $(<span style="color: #A2BF8A;">'.col-md-3'</span>) );

    <span style="color: #6f7787;">// </span><span style="color: #6f7787;">$('#footnotes').appendTo('.col-sm-9');</span>

    $(<span style="color: #A2BF8A;">'#toc'</span>).empty();
    $(<span style="color: #A2BF8A;">'#toc'</span>).addClass(<span style="color: #A2BF8A;">'nav-list'</span>);


    <span style="color: #80A0C2;">var</span> <span style="color: #dac6d6;">navSelector</span> = <span style="color: #A2BF8A;">'#toc'</span>;
    <span style="color: #80A0C2;">var</span> <span style="color: #dac6d6;">$myNav</span> = $(navSelector);
    Toc.init($myNav);
    $(<span style="color: #A2BF8A;">'body'</span>).scrollspy({
        target: navSelector
    });

    $(<span style="color: #A2BF8A;">'.org-src-container'</span>).addClass(<span style="color: #A2BF8A;">"card-body"</span>).wrap(<span style="color: #A2BF8A;">'&lt;div class="card"&gt;&lt;/div&gt;'</span>);
    $(<span style="color: #A2BF8A;">'.table'</span>).addClass(<span style="color: #A2BF8A;">"card-body"</span>).wrap(<span style="color: #A2BF8A;">'&lt;div class="card"&gt;&lt;/div&gt;'</span>);
    $(<span style="color: #A2BF8A;">'.card-body'</span>).each(<span style="color: #80A0C2;">function</span>() {$(<span style="color: #B58DAE;">this</span>).wrap(panelCollapse(<span style="color: #B58DAE;">this</span>))})
    $(<span style="color: #A2BF8A;">'.org-src-container'</span>).parent().each(<span style="color: #80A0C2;">function</span>() {$(<span style="color: #B58DAE;">this</span>).before(panelDiv(<span style="color: #B58DAE;">this</span>, <span style="color: #A2BF8A;">'Code'</span>))})
    $(<span style="color: #A2BF8A;">'.table'</span>).parent().each(<span style="color: #80A0C2;">function</span>() {$(<span style="color: #B58DAE;">this</span>).before(panelDiv(<span style="color: #B58DAE;">this</span>, <span style="color: #A2BF8A;">'Table'</span>))})
});

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alexander Fu Xi</p>
<p class="date">Created: 2018-03-22 Thu 21:58</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
